In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps
from sqlalchemy import create_engine

In [2]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. UNION vs. UNION ALL
### Exercises
Nice work learning all about UNION and UNION ALL!

Two tables, languages and currencies, are provided. Run the queries provided in the console and select the correct answer for the multiple-choice questions in this exercise.

### task 1
### Question
What result will the following SQL query produce?

SELECT * \
FROM languages\
UNION\
SELECT * \
FROM currencies;

### Possible Answers:
- A. All records from both tables, dropping duplicate records (if any)
- B. A SQL error, because languages and currencies do not have the same number of fields
- C. A SQL error, because languages and currencies do not have the same number of records

Answer: B

### task 2
### Question
What result will the following SQL query produce?

SELECT code FROM\
languages\
UNION ALL\
SELECT code FROM \
currencies;

### Possible Answers:
- A. An ordered list of each country code in languages and currencies, including duplicates
- B. An ordered list of each unique country code in languages and currencies
- C. An unordered list of each country code in languages and currencies, including duplicates
- D. An unordered list of each unique country code in languages and currencies

Answer: C

### task 3
### Question
What will the following SQL query produce?

SELECT code \
FROM languages\
UNION\
SELECT curr_id \
FROM currencies;

### Possible Answers:
- A. An empty result
- B. A stacked list of every curr_id from currencies and every code from languages
- C. A SQL error, because code and curr_id are not of the same data type
- D. A SQL error, because code and curr_id do not have the same name

Answer: C

# 2. Comparing global economies
### Exercises
Are you ready to perform your first set operation?

In this exercise, you have two tables, economies2015 and economies2019, available to you under the tabs in the console. You'll perform a set operation to stack all records in these two tables on top of each other, excluding duplicates.

When drafting queries containing set operations, it is often helpful to write the queries on either side of the operation first, and then call the set operator. The instructions are ordered accordingly.

### Instructions
- Begin your query by selecting all fields from economies2015.
- Create a second query that selects all fields from economies2019.
- Perform a set operation to combine the two queries you just created, ensuring you do not return duplicates.

In [3]:
%%sql

 -- Select all fields from economies2015
SELECT *
FROM economies2015    
-- Set operation
UNION
-- Select all fields from economies2019
SELECT *
FROM economies2019
ORDER BY code, year
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('ABW', 2015, 'High income', 14.867851),
 ('AGO', 2015, 'Lower middle income', 25.021326),
 ('AGO', 2019, 'Lower middle income', 25.524847)]

# 3. Comparing two set operations
### Exercises
You learned in the video exercise that UNION ALL returns duplicates, whereas UNION does not. In this exercise, you will dive deeper into this, looking at cases for when UNION is appropriate compared to UNION ALL.

You will be looking at combinations of country code and year from the economies and populations tables.

### task 1
### Instruction
- Perform an appropriate set operation that determines all pairs of country code and year (in that order) from economies and populations, excluding duplicates.
- Order by country code and year.

In [4]:
%%sql

-- Query that determines all pairs of code and year from economies and populations, without duplicates
SELECT code, year
FROM economies
UNION
SELECT country_code, year
FROM populations
GROUP BY country_code, year
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('ALB', 2010), ('ERI', 2010), ('TKM', 2015)]

### task 2
### Instruction
Amend the query to return all combinations (including duplicates) of country code and year in the economies or the populations tables.

In [5]:
%%sql

SELECT code, year
FROM economies
-- Set theory clause
UNION ALL
SELECT country_code, year
FROM populations
ORDER BY code, year
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('ABW', 2010), ('ABW', 2015), ('AFG', 2010)]

# 4. INTERSECT
### Exercises
Well done getting through the material on INTERSECT!

Let's say you are interested in those countries that share names with cities. Use this task as an opportunity to show off your knowledge of set theory in SQL!

### Instruction
Return all city names that are also country names.

In [6]:
%%sql

-- Return all cities with the same name as a country
SELECT name
FROM cities
INTERSECT
SELECT name as country
FROM countries;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[('Singapore',)]

# 5. Review UNION and INTERSECT
Which of the following definitions of set operations is correct?

### Answer the question
### Possible Answers

- A. UNION: returns all records (potentially duplicates) in both tables
- B. UNION ALL: returns only unique records
- C. INTERSECT: returns only records appearing in both tables
- D. None of the above definitions are correct.

Answer: C

# 6. You've got it, EXCEPT...
### Exercises
Just as you were able to leverage INTERSECT to find the names of cities with the same names as countries, you can also do the reverse, using EXCEPT.

In this exercise, you will find the names of cities that do not have the same names as their countries.

### Instruction
Return all cities that do not have the same name as a country.

In [8]:
%%sql

-- Return all cities that do not have the same name as a country
SELECT name
FROM cities
EXCEPT
SELECT name
FROM countries
ORDER BY name
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Abidjan',), ('Abu Dhabi',), ('Abuja',)]

# 7. Calling all set operators
Congratulations! You've now made your way to the challenge problem for this chapter. Test your knowledge of set operators in SQL by classifying the below use cases into the correct buckets.

Think of how the information in each use case could be stored as tables, and recall the Venn diagrams you have learned, shown below!
![](venn.png)

### Instruction
Drag and drop the use cases provided into the correct set operator.

### Drag the itemsinto the correct bucket
- You run a music streaming service and have a list of songs a user has listened to. You want to show them new songs they haven't heard before.
- A residence hall has asked students to rank their preferences to be assigned a room. They now want to pair students based on common preferences.
- You are a scholl teacher teaching multiple classes. You would like to combine the grades of all students into one consolidated sheet.

### Answers:
UNION or UNION ALL:
- You run a music streaming service and have a list of songs a user has listened to. You want to show them new songs they haven't heard before.

INTERSECT:
- A residence hall has asked students to rank their preferences to be assigned a room. They now want to pair students based on common preferences.

EXCEPT:
- You are a scholl teacher teaching multiple classes. You would like to combine the grades of all students into one consolidated sheet.